#### Terraform Plan 📖

```
[command]/home/runner/work/_temp/0144f1f6-00b2-427c-9280-d30721abf3dd/terraform-bin -chdir=deploy/infra show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_droplet.app will be created
  + resource "digitalocean_droplet" "app" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-22-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "asset-archive-dev-app"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "nyc3"
      + resize_disk          = true
      + size                 = "s-2vcpu-4gb"
      + ssh_keys             = (known after apply)
      + status               = (known after apply)
      + tags                 = [
          + "environment:dev",
          + "project:asset-archive",
          + "role:app",
          + "terraform:true",
          + "test-tag:workflow-test",
        ]
      + urn                  = (known after apply)
      + user_data            = (sensitive)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_firewall.web will be created
  + resource "digitalocean_firewall" "web" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + name            = "asset-archive-dev-web"
      + pending_changes = (known after apply)
      + status          = (known after apply)
      + tags            = [
          + "environment:dev",
          + "project:asset-archive",
        ]

      + inbound_rule {
          + port_range                = "1337"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "22"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "3000"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "443"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "80"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + protocol                       = "icmp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "udp"
        }
    }

  # digitalocean_project_resources.main will be created
  + resource "digitalocean_project_resources" "main" {
      + id        = (known after apply)
      + project   = "d2c0a376-79b7-4091-a1fa-0c82bca6a82a"
      + resources = (known after apply)
    }

  # digitalocean_ssh_key.main will be created
  + resource "digitalocean_ssh_key" "main" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "asset-archive-key"
      + public_key  = (sensitive)
    }

  # digitalocean_vpc.main will be created
  + resource "digitalocean_vpc" "main" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = "10.10.0.0/16"
      + name       = "asset-archive-dev-vpc"
      + region     = "nyc3"
      + urn        = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cms_admin_url                = (known after apply)
  + cms_url                      = (known after apply)
  + container_images             = {
      + cms      = "ghcr.io/davidb-onchain/asset-archive-cms:develop-137d3d6"
      + frontend = "ghcr.io/davidb-onchain/asset-archive-frontend:develop-137d3d6"
    }
  + domain_name                  = "No domain configured"
  + domain_record_fqdn           = "No domain configured"
  + droplet_id                   = (known after apply)
  + droplet_ipv4_address         = (known after apply)
  + droplet_ipv4_address_private = (known after apply)
  + droplet_name                 = "asset-archive-dev-app"
  + environment                  = "dev"
  + firewall_id                  = (known after apply)
  + frontend_url                 = (known after apply)
  + project_id                   = "d2c0a376-79b7-4091-a1fa-0c82bca6a82a"
  + project_name                 = "asset-archive-dev"
  + region                       = "nyc3"
  + ssh_connection               = (known after apply)
  + vpc_id                       = (known after apply)
  + vpc_ip_range                 = "10.10.0.0/16"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # digitalocean_droplet.app will be created%0A  + resource "digitalocean_droplet" "app" {%0A      + backups              = false%0A      + created_at           = (known after apply)%0A      + disk                 = (known after apply)%0A      + graceful_shutdown    = false%0A      + id                   = (known after apply)%0A      + image                = "ubuntu-22-04-x64"%0A      + ipv4_address         = (known after apply)%0A      + ipv4_address_private = (known after apply)%0A      + ipv6                 = false%0A      + ipv6_address         = (known after apply)%0A      + locked               = (known after apply)%0A      + memory               = (known after apply)%0A      + monitoring           = false%0A      + name                 = "asset-archive-dev-app"%0A      + price_hourly         = (known after apply)%0A      + price_monthly        = (known after apply)%0A      + private_networking   = (known after apply)%0A      + region               = "nyc3"%0A      + resize_disk          = true%0A      + size                 = "s-2vcpu-4gb"%0A      + ssh_keys             = (known after apply)%0A      + status               = (known after apply)%0A      + tags                 = [%0A          + "environment:dev",%0A          + "project:asset-archive",%0A          + "role:app",%0A          + "terraform:true",%0A          + "test-tag:workflow-test",%0A        ]%0A      + urn                  = (known after apply)%0A      + user_data            = (sensitive)%0A      + vcpus                = (known after apply)%0A      + volume_ids           = (known after apply)%0A      + vpc_uuid             = (known after apply)%0A    }%0A%0A  # digitalocean_firewall.web will be created%0A  + resource "digitalocean_firewall" "web" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "asset-archive-dev-web"%0A      + pending_changes = (known after apply)%0A      + status          = (known after apply)%0A      + tags            = [%0A          + "environment:dev",%0A          + "project:asset-archive",%0A        ]%0A%0A      + inbound_rule {%0A          + port_range                = "1337"%0A          + protocol                  = "tcp"%0A          + source_addresses          = [%0A              + "0.0.0.0/0",%0A              + "::/0",%0A            ]%0A          + source_droplet_ids        = []%0A          + source_kubernetes_ids     = []%0A          + source_load_balancer_uids = []%0A          + source_tags               = []%0A        }%0A      + inbound_rule {%0A          + port_range                = "22"%0A          + protocol                  = "tcp"%0A          + source_addresses          = [%0A              + "0.0.0.0/0",%0A            ]%0A          + source_droplet_ids        = []%0A          + source_kubernetes_ids     = []%0A          + source_load_balancer_uids = []%0A          + source_tags               = []%0A        }%0A      + inbound_rule {%0A          + port_range                = "3000"%0A          + protocol                  = "tcp"%0A          + source_addresses          = [%0A              + "0.0.0.0/0",%0A              + "::/0",%0A            ]%0A          + source_droplet_ids        = []%0A          + source_kubernetes_ids     = []%0A          + source_load_balancer_uids = []%0A          + source_tags               = []%0A        }%0A      + inbound_rule {%0A          + port_range                = "443"%0A          + protocol                  = "tcp"%0A          + source_addresses          = [%0A              + "0.0.0.0/0",%0A              + "::/0",%0A            ]%0A          + source_droplet_ids        = []%0A          + source_kubernetes_ids     = []%0A          + source_load_balancer_uids = []%0A          + source_tags               = []%0A        }%0A      + inbound_rule {%0A          + port_range                = "80"%0A          + protocol                  = "tcp"%0A          + source_addresses          = [%0A              + "0.0.0.0/0",%0A              + "::/0",%0A            ]%0A          + source_droplet_ids        = []%0A          + source_kubernetes_ids     = []%0A          + source_load_balancer_uids = []%0A          + source_tags               = []%0A        }%0A%0A      + outbound_rule {%0A          + destination_addresses          = [%0A              + "0.0.0.0/0",%0A              + "::/0",%0A            ]%0A          + destination_droplet_ids        = []%0A          + destination_kubernetes_ids     = []%0A          + destination_load_balancer_uids = []%0A          + destination_tags               = []%0A          + protocol                       = "icmp"%0A        }%0A      + outbound_rule {%0A          + destination_addresses          = [%0A              + "0.0.0.0/0",%0A              + "::/0",%0A            ]%0A          + destination_droplet_ids        = []%0A          + destination_kubernetes_ids     = []%0A          + destination_load_balancer_uids = []%0A          + destination_tags               = []%0A          + port_range                     = "1-65535"%0A          + protocol                       = "tcp"%0A        }%0A      + outbound_rule {%0A          + destination_addresses          = [%0A              + "0.0.0.0/0",%0A              + "::/0",%0A            ]%0A          + destination_droplet_ids        = []%0A          + destination_kubernetes_ids     = []%0A          + destination_load_balancer_uids = []%0A          + destination_tags               = []%0A          + port_range                     = "1-65535"%0A          + protocol                       = "udp"%0A        }%0A    }%0A%0A  # digitalocean_project_resources.main will be created%0A  + resource "digitalocean_project_resources" "main" {%0A      + id        = (known after apply)%0A      + project   = "d2c0a376-79b7-4091-a1fa-0c82bca6a82a"%0A      + resources = (known after apply)%0A    }%0A%0A  # digitalocean_ssh_key.main will be created%0A  + resource "digitalocean_ssh_key" "main" {%0A      + fingerprint = (known after apply)%0A      + id          = (known after apply)%0A      + name        = "asset-archive-key"%0A      + public_key  = (sensitive)%0A    }%0A%0A  # digitalocean_vpc.main will be created%0A  + resource "digitalocean_vpc" "main" {%0A      + created_at = (known after apply)%0A      + default    = (known after apply)%0A      + id         = (known after apply)%0A      + ip_range   = "10.10.0.0/16"%0A      + name       = "asset-archive-dev-vpc"%0A      + region     = "nyc3"%0A      + urn        = (known after apply)%0A    }%0A%0APlan: 5 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + cms_admin_url                = (known after apply)%0A  + cms_url                      = (known after apply)%0A  + container_images             = {%0A      + cms      = "ghcr.io/davidb-onchain/asset-archive-cms:develop-137d3d6"%0A      + frontend = "ghcr.io/davidb-onchain/asset-archive-frontend:develop-137d3d6"%0A    }%0A  + domain_name                  = "No domain configured"%0A  + domain_record_fqdn           = "No domain configured"%0A  + droplet_id                   = (known after apply)%0A  + droplet_ipv4_address         = (known after apply)%0A  + droplet_ipv4_address_private = (known after apply)%0A  + droplet_name                 = "asset-archive-dev-app"%0A  + environment                  = "dev"%0A  + firewall_id                  = (known after apply)%0A  + frontend_url                 = (known after apply)%0A  + project_id                   = "d2c0a376-79b7-4091-a1fa-0c82bca6a82a"%0A  + project_name                 = "asset-archive-dev"%0A  + region                       = "nyc3"%0A  + ssh_connection               = (known after apply)%0A  + vpc_id                       = (known after apply)%0A  + vpc_ip_range                 = "10.10.0.0/16"%0A
::debug::stderr: 
::debug::exitcode: 0

```
*Pushed by: @davidb-onchain, Action: `pull_request`*